Arithmetic Operation

In [2]:
import pandas as pd

In [4]:
var=pd.DataFrame({"A":[1,2,3,4],"B":[5,6,7,8]})
var

   A  B
0  1  5
1  2  6
2  3  7
3  4  8

In [9]:
# Addition, Subtraction, Multiplication, Division

var["Add"]=var["A"]+var["B"]
var["Sub"]=var["A"]-var["B"]
var["Mul"]=var["A"]*var["B"]
var["Div"]=var["A"]/var["B"]

var

   A  B  Add  Sub  Mul       Div
0  1  5    6   -4    5  0.200000
1  2  6    8   -4   12  0.333333
2  3  7   10   -4   21  0.428571
3  4  8   12   -4   32  0.500000

In [18]:
# Logical operations

var1=pd.DataFrame({"A":[10,20,30,40],"B":[15,16,17,18]})


var1["A is Greater"] = var1["A"]<=20
var1["B is Greater"] = var1["B"]>=20

var1

    A   B  A is Greater  B is Greater
0  10  15          True         False
1  20  16          True         False
2  30  17         False         False
3  40  18         False         False